_posts/2017-02-14-bsides-ctf-writeup.html
---
layout: page
title: San Francisco BSides CTF Writeup
category: note
tags:
 - post
 - ctf
 - infosec
---
<section id="outline-container-org35e68df" class="outline-2">
<h2 id="org35e68df">Writeups</h2>
<div class="outline-text-2" id="text-org35e68df">
<p>
Because so many of these challenges don&rsquo;t have their answers published by their
organizers after the event is settled, it&rsquo;s up to the community to put together
&rsquo;writeups&rsquo; of the techniques employed in solving these. 
</p>

<p>
Here&rsquo;s a few of those.
</p>
</div>


<div id="outline-container-orgfbfb13a" class="outline-3">
<h3 id="orgfbfb13a">NOP</h3>
<div class="outline-text-3" id="text-orgfbfb13a">
<p>
The <code>NOP</code> instruction is microcode for <code>xchg EAX, EAX</code>
</p>
</div>
</div>
<div id="outline-container-org039df31" class="outline-3">
<h3 id="org039df31">easycap</h3>
<div class="outline-text-3" id="text-org039df31">
<p>
This challenge doesn&rsquo;t include the flag in a string because it&rsquo;s spread out over
multiple packets. You can easily extract the flag by &rsquo;following&rsquo; a TCP stream in
your network packet capture software of choice.
</p>
</div>
</div>

<div id="outline-container-org8a67447" class="outline-3">
<h3 id="org8a67447">easy</h3>
<div class="outline-text-3" id="text-org8a67447">
<p>
This challenge doesn&rsquo;t require you to perform any reverse engineering as the
the flag is visible as a direct <code>.symstrtab</code> entry.
</p>

<pre class="example" id="org10ae2f3">
zv@syszv &gt;&gt; strings easy-64 | grep -i flag
FLAG:db2f62a36a018bce28e46d976e3f9864
</pre>
</div>
</div>
