_posts/2017-02-14-bsides-ctf-writeup.html

<div id="outline-container-org8c8baa3" class="outline-3">
<h3 id="org8c8baa3">Skipper</h3>
<div class="outline-text-3" id="text-org8c8baa3">
<p>
In this challenge I&rsquo;m going to use one of the best disassemblers available
today: <a href="http://radare.org/r/">radare</a> . It is both free and contains many facilities for modifying
the binary in various ways (without plugins). (You could also solve this
challenge with a debugger very easily)
</p>

<pre class="example" id="org901eadd">
cp tmp/skipper64 /tmp/skipper64-backup # a backup in case you fubar the binary
r2 /tmp/skipper64
</pre>

<p>
Next, seek the read head to the <code>main</code> symbol and tap <code>V</code> key to bring yourself
into disassembly.
</p>

<pre class="example" id="orgbf63e83">
[0x004026d1]&gt; s main
</pre>

<pre class="example" id="org4f41f9d">
    0x004026d1      push rbp                                                                                                                                                                                
    0x004026d2      mov rbp, rsp                                                                                                                                                                            
    0x004026d5      sub rsp, 0x420                                                                                                                                                                          
    0x004026dc      mov dword [rbp - 0x414], edi                                                                                                                                                            
    0x004026e2      mov qword [rbp - 0x420], rsi                                                                                                                                                            
    0x004026e9      mov rax, qword fs:[0x28]                   ; [0x28:8]=0x3200 ; '('                                                                                                                      
    0x004026f2      mov qword [rbp - 8], rax                                                                                                                                                                
    0x004026f6      xor eax, eax                                                                                                                                                                            
    0x004026f8      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x004026ff      mov rdi, rax                                                                                                                                                                            
    0x00402702      call 0x400b3e                              ;[1]                                                                                                                                         
    0x00402707      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x0040270e      mov rsi, rax                                                                                                                                                                            
    0x00402711      mov edi, str.Computer_name:__s_n           ; "Computer name: %s." @ 0x402987                                                                                                            
    0x00402716      mov eax, 0                                                                                                                                                                              
    0x0040271b      call sym.imp.printf                        ;[2]                                                                                                                                         
    0x00402720      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x00402727      mov esi, str.hax0rz__                      ; "hax0rz!~" @ 0x40299a                                                                                                                      
    0x0040272c      mov rdi, rax                                                                                                                                                                            
    0x0040272f      call sym.imp.strcmp                        ;[3]                                                                                                                                         
    0x00402734      test eax, eax                                                                                                                                                                           
┌─&lt; 0x00402736      je 0x40275b                                ;[4]                                                                                                                                         
│   0x00402738      lea rax, [rbp - 0x410]                                                                                                                                                                  
│   0x0040273f      mov rsi, rax                                                                                                                                                                            
│   0x00402742      mov edi, str.Sorry ; "Sorry, your computer's name - %s - is not correct!." @ 0x4029a8                                                    
│   0x00402747      mov eax, 0                                                                                                                                                                              
│   0x0040274c      call sym.imp.printf                        ;[2]                                                                                                                                         
│   0x00402751      mov edi, 9                                                                                                                                                                              
│   0x00402756      call sym.imp.raise                         ;[5]                                                                                                                                         
└─&gt; 0x0040275b      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x00402762      mov rdi, rax                                                                                                                                                                            
    0x00402765      call 0x400c4a                              ;[6]                                                                                                                                         
    0x0040276a      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x00402771      mov rsi, rax                                                                                                                                                                            
    0x00402774      mov edi, str.OS_version:__s_n              ; "OS version: %s." @ 0x4029dc                                                                                                               
    0x00402779      mov eax, 0                                                                                                                                                                              
    0x0040277e      call sym.imp.printf                        ;[2]                                                                                                                                         
    0x00402783      lea rax, [rbp - 0x410]                                                                                                                                                                  
    0x0040278a      mov esi, str.2.4.31                        ; "2.4.31" @ 0x4029ec                                                                                                                        
    0x0040278f      mov rdi, rax                                                                                                                                                                            
    0x00402792      call sym.imp.strcmp                        ;[3]                                                                                                                                         
    0x00402797      test eax, eax                                                                                                                                                                           
┌─&lt; 0x00402799      je 0x4027e3                                ;[7]                                                                                                                                         
│   0x0040279b      lea rax, [rbp - 0x410]                                                                                                                                                                  
│   0x004027a2      mov rsi, rax                                                                                                                                                                            
│   0x004027a5      mov edi, str.Sorry__your_OS_version____s___is_not_supported__n
</pre>

<p>
You can see here that several functions are being called and compared against
builtin strings like <i>hax0r!~</i>. The context gives you an idea that it&rsquo;s checking
the hostname, but let&rsquo;s be sure.
</p>

<pre class="example" id="orga4c3124">
[0x004026d1]&gt; s 0x400b3e
[0x00400b67]&gt; pd 10 @ +64
0x00400ba7      mov edi, 1
0x00400bac      call sym.imp.exit
0x00400bb1      mov ecx, 0
0x00400bb6      mov edx, 0x40291f                          ; "-n"
0x00400bbb      mov esi, str.uname                         ; "uname" @ 0x402922
0x00400bc0      mov edi, str.uname                         ; "uname" @ 0x402922
0x00400bc5      mov eax, 0
0x00400bca      call sym.imp.execlp
0x00400bcf      call sym.imp.__errno_location
0x00400bd4      mov eax, dword [rax]
</pre>

<p>
You can see it&rsquo;s calling <code>uname</code> here. Before you start changing your system&rsquo;s
configuration to accommodate, first know it&rsquo;s not possible to set your hostname
to this value.
</p>

<p>
This means you are going to either have to use a debugger and manually change
the <code>ZF</code>, <code>CF</code>, <code>OF</code> or other condition flags or patch up all of the <code>je</code>
instructions.
</p>

<pre class="example" id="org798d965">
[0x00400b67]&gt; oo+ # This makes the binary writable
[0x00400b67]&gt; wao jmp @ 0x00402736
[0x00400b67]&gt; wao jmp @ 0x00402799
...
</pre>

<p>
After this, run the binary and get the flag! <code>FLAG:f51579e9ca38ba87d71539a9992887ff</code>
</p>
</div>
</div>
